import pytest

from app.main import get_coin_combination


@pytest.mark.parametrize(
    "cents, expected",
    [
        (1, [1, 0, 0, 0]),  # Випробування одного цента
        (5, [0, 1, 0, 0]),  # Випробування однієї монети у 5 центів
        (10, [0, 0, 1, 0]),  # Випробування однієї монети у 10 центів
        (25, [0, 0, 0, 1]),  # Випробування однієї монети у 25 центів
        (6, [1, 1, 0, 0]),  # Комбінація 1 і 5 центів
        (30, [0, 1, 0, 1, ]),  # Комбінація 25 і 5 центів
        (99, [4, 0, 2, 3]),  # Комбінація всіх монет
        (41, [1, 1, 1, 1]),  # Комбінація 1, 5, 10, 25 центів
        (0, [0, 0, 0, 0]),  # Нуль центів
        (100, [0, 0, 0, 4]),  # Тільки монети по 25 центів
        (11, [1, 0, 1, 0]),  # 1 цент та 10 центів
        (16, [1, 1, 1, 0]),  # 1 цент, 5 центів, 10 центів
        (55, [0, 1, 0, 2]),  # Комбінація 5, 10, 25 центів
        (75, [0, 0, 0, 3]),  # Тільки монети по 25 центів
        (50, [0, 0, 0, 2]),  # Тільки монети по 25 центів
        (23, [3, 0, 2, 0]),  # 3 цента, 2 монети по 10 центів
        (57, [2, 1, 0, 2]),  # Різноманітна комбінація
    ]
)
def test_get_coin_combination(cents: int, expected: list) -> None:
    assert get_coin_combination(cents) == expected
